authz_benchmark/jmeter_report/k8s_1ng_1j_3r_4800t_600e_4cpu_async2_https_http2/h2load.out
starting benchmark...
spawning thread #0: 4800 total client(s). Timing-based test with 0s of warm-up time and 900s of main duration for measurements.
Warm-up started for thread #0.
progress: 10% of clients started
progress: 20% of clients started
progress: 30% of clients started
progress: 40% of clients started
progress: 50% of clients started
progress: 60% of clients started
progress: 70% of clients started
progress: 80% of clients started
progress: 90% of clients started
progress: 100% of clients started
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
TLS Protocol: TLSv1.3
Cipher: TLS_AES_256_GCM_SHA384
Server Temp Key: X25519 253 bits
Application protocol: h2
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0

finished in 901.21s, 2785.19 req/s, 20.94MB/s
requests: 2506675 total, 2511475 started, 2506675 done, 2506675 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 2506675 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 18.40GB (19759267075) total, 243.84MB (255680850) headers (space savings 32.00%), 18.08GB (19411691200) data
                     min         max         mean         sd        +/- sd
time for request:   165.54ms       5.28s       1.72s    131.17ms    81.21%
time for connect:   400.95ms       2.76s       1.56s    678.47ms    60.00%
time to 1st byte:      2.24s       7.27s       3.77s       1.26s    63.04%
req/s           :       0.58        0.58        0.58        0.00    71.25%